
Connect Four Server Interface 
=============================

Version 1.0 (08/2016; Olli)
Version 1.1 (09/2016; Olli) Added final scores to bestmove response
Version 1.1.1 (10/2016; Olli) Better examples and wording 

Introduction
============

This document specifies an interface of a Connect Four Game Server.

Key points:

- The communication between client and server is text based.
- The communication is asynchronous.
- The server doesn't hold a game state.

Token, Coordinate System, Placement
===================================

Definition of tokens and board placement is based on the CCFI specification
as defined here: https://github.com/adamsc/common-connect-four-interface

Token
-----

The two pieces of the game are represented by the tokens 'x' and 'o'.

Coordinate system
-----------------

- The bottom left corner of the board has the coordinate (x=0, y=0).
- The upper left corner has the coordinate (x=0, y=height-1).
- The bottom right corner has the coordinate (x=width-1, y=0).
- The upper right corner has the coordinate (x=width-1, y=height-1).

Piece placement
---------------

- The placement consists of a string containing the rows of the board.
- Rows are separated by the '/' (slash) character.
- The placement string starts with the bottom row (y = 0).
- Each row specifies the piece placement from left to right.
- An occupied field is represented by it's token.
- Empty fields are represented by a number that is the count of
  successive empty columns.

Example:

An empty board consisting of 6 rows and 7 columns. 

The placement string is: 7/7/7/7/7/7

Example:

For the  board
_ _ _ _ _ _ _ _
_ _ _ _ _ _ _ x
o _ _ x x x _ o
o o _ o x o _ x

the placement string is: oo1oxo1x/o2xxx1o/7x/8

Commands
========

start
-----

Starts the server. The server sends back a "started" response when
initialization of the server has completed.

Example:

> start
< started

stop
----

Stops the server. After having received the stop command the
server will not send back any messages to the client and will not
accept new commands.

ping
----

This command can be sent any time to check if the server is still alive.
The server will immediately respond with "pong", even if it's currently processing
a command.

Syntax: ping

Example:

> play ...
> ping
< pong
< bestmove ...

play
----

Let the server calculate a move. Each play command is answered by the server
with a "bestmove" response.

Syntax: play <board> <token> <depth>
	[--column <column>]

<board> The placement of the board

<token> The token the computer shall play

<depth> Number of plies (half-moves) the computer shall play. The value must
be greater than zero.

--column <column> Specifies the column that shall be played by the server. The main
purpose of this parameter is to allow a client to easily evaluate a move that has been
chosen by a player.

quit
----

Quits the running and pending commands. Commands will stop as soon as possible.
While processing the Quit command new commands are accepted but will also be quit.

Example:

> play ...
< info ...
< info ...
> quit
< info ...
< bestmove ...

Example:

> play ...
> play ...
> quit
< bestmove ...
< bestmove ...

Responses
=========

pong
----

The answer of a ping command

bestmove
--------

For each play command a "bestmove" response is sent back to the client.

Syntax: bestmove column
	[--score <score>]
	[--four column {/column}* ]
	[--line column;row {/column;row}* ]
	[--final-scores column;score {/column;score}* ]

column: NULL or the column that the computer has played. A column
value of NULL signals that no move was available.

--score <score>:  -1 >= <score> <= 1 The score as seen by the computer. A negative value
indicates a situation where the computer may lose. 

--four This parameter signals that the computer has won or will win after the given
sequence of moves. The move sequence includes the current move.

--line In the case of a direct four the server provides the piece placement that
establishes the line of connected pieces.

--final-scores The score of each column the computer has investigated.

Example:

> play xxx/ooo/xxx x 1
< bestmove NULL

Example:

> play 4/4/4/4 x 1
< bestmove 1 --score 0.05078125 --scores 0;0.05078125/1;0.05078125/2;0.05078125/3;0.05078125

Example:

> play x3/x3/x3/4 x 1
< bestmove 0 --score 1.0 --four 0 --line 0;0/0;1/0;2/0;3 --scores 0;1.0/1;0.203125/2;0.203125/3;0.203125

Example:

> play xoxx2/xxoo1o/xxoo1o/ox4 o 4
< bestmove 4 --score 0.01 --four 4/4 --scores 2;-0.00013541667/3;-0.000140625/4;0.01/5;-0.00014756944

info
----

An informational message. Informational messages can be sent to
the client any time.

Syntax: info [--plies <number>] [....]

--plies <number> The number of plies (half-moves) the computer has played so far
while processing the current play command.
  
Example:

> play ...
< info --plies 56780
< info --plies 100000
< bestmove ...

debug
-----

A debug message. Debug messages can be sent to the client any time.
They can be used by a server to indicate for example syntax errors.

Syntax: debug message

Example:

> play 6/6/6 a 1
< debug Command PLAY called with invalid arguments.


